#include<iostream>
using namespace std;

int main()
{
	//从1开始数到100，如果数字个位十位为7 或者 是7的倍数 打印敲桌子，其余数字打印输出
	//1.输出1-100
	//2.找到特殊数字，改为敲桌子，
	//	特殊数字
	//	7的倍数		（7	14	21	28）%7 = 0
	//	个位有7		（7	17	27	37）%10 = 7 
	//	十位有7		（70	 71	72	73）/10 = 7


	for (int i = 1; i < 100; i++)
	{
		//2.找到特殊数字，改为敲桌子
		//满足条件 
		if (i%7==0 || i%10 == 7 || i/10 == 7)//满足条件 敲桌子
		{
			cout << "boom!!!" << endl;
		}
		else//不满足，打印数字
		{
			cout << i << endl;
		}
	}
	system("pause");

	return 0;
}
